// 1.单一变量与指针
// 指针操作最常用的 * 一元运算符是间接寻址或间接引用运算符。
// 我们常称取值符在单一变量指针中海油一个常用的符号是 & 取地址符，顾名思义就是获取变量的地址

int a = 1;
// 定义指针变量，注意类型
int *p;

// 通过地址符获取地址
p = &a; // *p = 1

// 修改 a 的 指
*p = 3; // a = 3
printf("%d", *p); // *p = 3

// 指针也可以复制成其他指针
int a = 1, b = 2, *p, *q;
p = &a
q = &b;
p = q
// *p = 2

/*
  补充
  地址运算符 & 只能应用于内存种的变量，即数组元素和变量，他不能用于表达式，常亮或register类型的变量
*/


// ----------------------------------------------------------------------------------------------------
// 2.指针与一维数组
// 用指针编写的程序比用数组编写的程序之星快，但另方面，指针实现不易理解

// statement an array
int a[10];

int a[] = {10, 12};
int *p;
p = &a[0];
// *p = 10

// 获取上一个元素
p = &a[1];
printf("%d", *(p - 1)); // 10

/*
      p    p+1   p+2
  a: [10,  12,   14]
      a[0] a[1]  a[2]
*/

// ----------------------------------------------------------------------------------------------------
// 3.指针与二维数组
// 数组名就是该数组的第一个元素地址。且数组地址是不变的，可以理解为常量。

int a[2][4] = {{12, 21, 35, 47}, {98, 43, 56, 67}};
int *p;
p = &a[0][0];
printf("%d", *p);
printf("%d", *(p + 4)); // 98

// 获取上一个
p = &a[1][0];
printf("%d", *( p -1)); // 47


int a[2][3] = {{21,4324,3543}, {764, 943, 123}};
// 注意看定义方式
int (*p)[3];
p = a;

for(int i =0;i < 2; i++){
  for (int j=0; j < 3; j++){
    // i 是行 j 是列
    printf("%d\t", *(*(p+ i)+ j));
  }
  printf("\n");
}


// 4.数组指针的简写
// 复制给指针
&a[i] = a + i
a[i] = *(a + i);

