// 1.define
// 可以把符号名(或者称为符号常量) 定义为指定的值
#define MAX 10;
#define NAME "123sfasd"

/*
  注意
    分号：#define 结束没有分号
    维护性差：#define 是预处理指令并不会检查替换内容的错误，所以维护性差
*/

// ----------------------------------------------------------------------------------------------------
// 2.const
const int A = 1;

// ----------------------------------------------------------------------------------------------------
// 3.字符常量
char a = "A";
a = a + 32;
// a = "a"

// ----------------------------------------------------------------------------------------------------
// 4.枚举常亮
enum bool = {No, Yes}

enum months = { Jan = 1, Feb = 2, Mar = 3}

enum months = { Jan = 1, Feb, Mar}
