// 用户名 4到16位（字母，数字，下划线，减号）
var userName = /^[a-zA-Z0-9_-]{4,16}$/

// 密码强度正则，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
var password = /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/

// 是否由数字和字母组成
var allNumOrWord = /[0-9A-Za-z]+&/

// 帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线组合
var account = /^[a-zA-Z][a-zA-Z0-9_]{4,15}$/

// 身份证
var id = / (^\d{8}(0\d|11|12)([0-2]\d|30|31)\d{3}$) | (^\d{6}(18|19|20)\d{2}(0\d|11|12)([0-2]\d|30|31)\d{3}(\d|X|x)$) /


var a = `abToomhaTiimmm`.replace(/T(oo|ii)/g, '-')

// https://github.com/any86/any-rule

// '2018-02-11'
//  02/11/2018
var time = '2018-02-11'.replace(/(\d{4})\-(\d{2})\-(\d{2})/g, '$2/$3/$1')

console.log(time)